Autodesk.Revit.DB.BuiltInParameterGroup.PG_TOPOSOLID_SUBDIVISION
"Toposolid Subdivision"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_LIFE_SAFETY
"Life Safety"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL_ANALYSIS
"Electrical Analysis"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ALTERNATE_UNITS
"Alternate Units"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PRIMARY_UNITS
"Primary Units"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_WALL_CROSS_SECTION_DEFINITION
"Cross-Section Definition"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ROUTE_ANALYSIS
"Route Analysis"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GEO_LOCATION
"Geolocation"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STRUCTURAL_SECTION_GEOMETRY
"Structural Section Geometry"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_BLDG_CONS_MTL_THERMAL_PROPS
"Material Thermal Properties"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_ROOM_SPACE_DATA
"Room/Space Data"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_BUILDING_DATA
"Building Data"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_COUPLER_ARRAY
"Set"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_ADVANCED
"Advanced"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RELEASES_MEMBER_FORCES
"Releases / Member Forces"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SECONDARY_END
"Secondary End"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PRIMARY_END
"Primary End"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_MOMENTS
"Moments"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_FORCES
"Forces"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_FABRICATION_PRODUCT_DATA
"Fabrication Product Data"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_REFERENCE
"Reference"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GEOMETRY_POSITIONING
"Geometric Position"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_DIVISION_GEOMETRY
"Division Geometry"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SEGMENTS_FITTINGS
"Segments and Fittings"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONTINUOUSRAIL_END_TOP_EXTENSION
"Extension (End/Top)"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONTINUOUSRAIL_BEGIN_BOTTOM_EXTENSION
"Extension (Beginning/Bottom)"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIRS_WINDERS
"Winders"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIRS_SUPPORTS
"Supports"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIRS_OPEN_END_CONNECTION
"End Connection"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SECONDARY_FAMILY_HANDRAILS
"Handrail 2"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TERMINATION
"Terminations"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIRS_TREADS_RISERS
"Threads/Risers"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIRS_CALCULATOR_RULES
"Calculation Rules"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SPLIT_PROFILE_DIMENSIONS
"Dimensions     (linear units or % of thickness)"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_LENGTH
"Length"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_NODES
"Nodes"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ANALYTICAL_PROPERTIES
"Analytical Properties"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ANALYTICAL_ALIGNMENT
"Analytical Alignment"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SYSTEMTYPE_RISEDROP
"Rise / Drop"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_LINING
"Lining"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_INSULATION
"Insulation"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_OVERALL_LEGEND
"Overall Legend"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_VISIBILITY
"Visibility"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SUPPORT
"Supports"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SEGMENT_V_GRID
"V Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SEGMENT_U_GRID
"U Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SEGMENT_POSTS
"Posts"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SEGMENT_PATTERN_REMAINDER
"Pattern Remainder"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_SEGMENT_PATTERN_REPEAT
"Pattern Repeat"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_FAMILY_SEGMENT_PATTERN
"Segment Pattern (default)"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_FAMILY_HANDRAILS
"Handrail 1"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_RAILING_SYSTEM_FAMILY_TOP_RAIL
"Top Rail"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONCEPTUAL_ENERGY_DATA_BUILDING_SERVICES
"Energy Model - Building Services"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_DATA
"Data"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL_CIRCUITING
"Electrical - Circuiting"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GENERAL
"General"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_FLEXIBLE
"Adaptive Component"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_CONCEPTUAL_MODEL
"Energy Analytical Model"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_DETAILED_MODEL
"Detailed Model"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS_DETAILED_AND_CONCEPTUAL_MODELS
"Essential"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_FITTING
"Fittings"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONCEPTUAL_ENERGY_DATA
"Conceptual Energy Data"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_AREA
"Area"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ADSK_MODEL_PROPERTIES
"Model Properties"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_V
"V Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_U
"U Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_DISPLAY
"Display"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ANALYSIS_RESULTS
"Analysis Results"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_SLAB_SHAPE_EDIT
"Slab Shape Edit"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_LIGHT_PHOTOMETRICS
"Photometrics"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PATTERN_APPLICATION
"Pattern Application"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GREEN_BUILDING
"Green Building Properties"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PROFILE_2
"Profile 2"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PROFILE_1
"Profile 1"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PROFILE
"Profile"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TRUSS_FAMILY_BOTTOM_CHORD
"Bottom Chords"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TRUSS_FAMILY_TOP_CHORD
"Top Chords"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TRUSS_FAMILY_DIAG_WEB
"Diagonal Webs"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TRUSS_FAMILY_VERT_WEB
"Vertical Webs"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TITLE
"Title Text"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_FIRE_PROTECTION
"Fire Protection"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ROTATION_ABOUT
"Rotation about"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TRANSLATION_IN
"Translation in"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ANALYTICAL_MODEL
"Analytical Model"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_REBAR_ARRAY
"Rebar Set"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_REBAR_SYSTEM_LAYERS
"Layers"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID
"Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_MULLION_2
"Grid 2 Mullions"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_MULLION_HORIZ
"Horizontal Mullions"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_MULLION_1
"Grid 1 Mullions"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_MULLION_VERT
"Vertical Mullions"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_2
"Grid 2"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_HORIZ
"Horizontal Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_1
"Grid 1"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CURTAIN_GRID_VERT
"Vertical Grid"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_IFC
"IFC Parameters"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL
"Electrical"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ENERGY_ANALYSIS
"Energy Analysis"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STRUCTURAL_ANALYSIS
"Structural Analysis"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_MECHANICAL_AIRFLOW
"Mechanical - Flow"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_MECHANICAL_LOADS
"Mechanical - Loads"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL_LOADS
"Electrical - Loads"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL_LIGHTING
"Electrical - Lighting"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_TEXT
"Text"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_VIEW_CAMERA
"Camera"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_VIEW_EXTENTS
"Extents"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PATTERN
"Pattern"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONSTRAINTS
"Constraints"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PHASING
"Phasing"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_MECHANICAL
"Mechanical"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STRUCTURAL
"Structural"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_PLUMBING
"Plumbing"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_ELECTRICAL_ENGINEERING
"Electrical Engineering"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIR_STRINGERS
"Stringers"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIR_RISERS
"Risers"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_STAIR_TREADS
"Treads"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_UNDERLAY
"Underlay"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_MATERIALS
"Materials and Finishes"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GRAPHICS
"Graphics"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_CONSTRUCTION
"Construction"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_GEOMETRY
"Dimensions"

Autodesk.Revit.DB.BuiltInParameterGroup.PG_IDENTITY_DATA
"Identity Data"